	      IDENTIFICATION DIVISION.
	      PROGRAM-ID. hello.
	      ENVIRONMENT DIVISION.
	      PROCEDURE DIVISION.
	         DISPLAY "Hello World!".
		     STOP RUN.
